Revit 2027 API
ParameterTypeId.RenderRpcProperties Property
 "Render Appearance Properties"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RenderRpcProperties { get; }
Public Shared ReadOnly Property RenderRpcProperties As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RenderRpcProperties {
	ForgeTypeId^ get ();
}
static member RenderRpcProperties : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace